In [61]:
import pandas as pd

In [62]:
# To load the dataframe from the `fortune500.csv` file, you can use the following code:
df = pd.read_csv('fortune500.csv')
df.head(11)

    Year  Rank           Company  Income Revenue
0   1955     1    General Motors  9823.5     806
1   1955     2       Exxon Mobil  5661.4   584.8
2   1955     3        U.S. Steel  3250.4   195.4
3   1955     4  General Electric  2959.1   212.6
4   1955     5            Esmark  2510.8    19.1
5   1955     6          Chrysler  2071.6    18.5
6   1955     7            Armour  2056.1     1.6
7   1955     8          Gulf Oil  1705.3   182.8
8   1955     9             Mobil  1703.6   183.8
9   1955    10            DuPont  1687.7   344.4
10  1955    11             Amoco  1667.4   132.8

1. Tính Income trung bình của từng Company qua các Year

In [63]:
mean_income_yearly = df.groupby(['Company', 'Year'])['Income'].mean().reset_index(name='MeanIncome')
mean_income_yearly

                  Company  Year  MeanIncome
0                    3Com  1994       617.2
1                    3Com  1998      3147.1
2                    3Com  1999      5420.4
3                    3Com  2000      5772.1
4                    3Com  2001      5391.5
...                   ...   ...         ...
25446  Zenith Electronics  1991      1414.5
25447  Zenith Electronics  1992      1321.6
25448  Zenith Electronics  1993      1271.4
25449  Zenith Electronics  1994      1228.2
25450     Zurn Industries  1991       610.6

[25451 rows x 3 columns]

2. Tính Revenue trung bình của từng Company qua các Year

In [64]:
# Ensure the 'Revenue' column is numeric
df['Revenue'] = pd.to_numeric(df['Revenue'], errors='coerce') # convert N.A to NaN 

# Group by 'Company' and calculate the mean of 'Revenue'
mean_revenue_yearly = df.groupby(['Company', 'Year'])['Revenue'].mean().reset_index(name='MeanRevenue')
mean_revenue_yearly

                  Company  Year  MeanRevenue
0                    3Com  1994         38.6
1                    3Com  1998        374.0
2                    3Com  1999         30.2
3                    3Com  2000        403.9
4                    3Com  2001        674.3
...                   ...   ...          ...
25446  Zenith Electronics  1991        -63.3
25447  Zenith Electronics  1992        -51.6
25448  Zenith Electronics  1993       -105.9
25449  Zenith Electronics  1994        -97.0
25450     Zurn Industries  1991         28.3

[25451 rows x 3 columns]

In [65]:
company_mean = pd.merge(mean_income_yearly, mean_revenue_yearly, on=['Company', 'Year'])
company_mean.head()

  Company  Year  MeanIncome  MeanRevenue
0    3Com  1994       617.2         38.6
1    3Com  1998      3147.1        374.0
2    3Com  1999      5420.4         30.2
3    3Com  2000      5772.1        403.9
4    3Com  2001      5391.5        674.3

3. Xác định Company có Income trung bình cao nhất

In [71]:
highest_mean_revenue_yearly = company_mean.sort_values(by='MeanIncome').idxmax()
highest_mean_revenue_yearly.head()

Company        25450
Year            5276
MeanIncome     24300
MeanRevenue     8591
dtype: int64

4. Xác định Company có Revenue trung bình thấp nhất

In [93]:
min_revenue = company_mean['MeanRevenue'].idxmin()
lowest_mean_revenue_yearly = company_mean[company_mean['MeanRevenue'] == min_revenue]
lowest_mean_revenue_yearly

Empty DataFrame
Columns: [Company, Year, MeanIncome, MeanRevenue]
Index: []

In [83]:
# Verify Result
lowest_mean_revenue_yearly = company_mean.sort_values(by='MeanRevenue', ascending=True)
lowest_mean_revenue_yearly.head()

                    Company  Year  MeanIncome  MeanRevenue
6462       Copperweld Steel  1955        49.7          0.9
10619       Goodall-Sanford  1955        49.7         -2.7
6756   Cuban-American Sugar  1955        50.1          0.7
3923                Bullard  1955        50.2          4.8
20953        Signal Oil Gas  1955        50.2          9.3

5. Tìm Company có Income lớn nhất mỗi Year

In [50]:
most_revenue_year = df.loc[df.groupby('Year')['Income'].idxmax()]
most_revenue_year.head()

       Năm  Xếp hạng         Công ty  Doanh thu Lợi nhuận  mean_income
0     1955         1  General Motors     9823.5       806  4273.329635
500   1956         1  General Motors    12443.3    1189.5  4273.329635
1000  1957         1  General Motors    10796.4     847.4  4273.329635
1500  1958         1  General Motors    10989.8     843.6  4273.329635
2000  1959         1  General Motors     9522.0     633.6  4273.329635

6. Tìm những Company thường nằm trong top 5 Company có Income lớn nhất qua mỗi Year

In [51]:
top5_most_revenue = most_revenue_year.nlargest(5, 'Income')
top5_most_revenue.head(30)

        Năm  Xếp hạng          Công ty  Doanh thu Lợi nhuận  mean_income
25000  2005         1  Wal-Mart Stores   288189.0     10267  4273.329635
24500  2004         1  Wal-Mart Stores   258681.0      9054  4273.329635
24000  2003         1  Wal-Mart Stores   246525.0      8039  4273.329635
23500  2002         1  Wal-Mart Stores   219812.0      6671  4273.329635
23000  2001         1      Exxon Mobil   210392.0     17720  4273.329635

7. Lọc ra 5 Company có Income trung bình thấp nhất

In [52]:
most_revenue_year = df.loc[df.groupby('Year')['Income'].idxmin()]
most_revenue_year.head()

,Năm,Xếp hạng,Công ty,Doanh thu,Lợi nhuận,mean_income
498,1955,499,Goodall-Sanford,49.7,-2.7,4273.329635
999,1956,500,Warren (S.D.),55.1,2.9,4273.329635
1499,1957,500,Consolidated Coppermines,61.1,5.7,4273.329635
1999,1958,500,Akzona,64.7,1.3,4273.329635
2499,1959,500,Blue Bell,61.7,1.7,4273.329635

8. Lọc ra 5 Company có Revenue trung bình cao nhất

In [54]:
top5_most_revenue.nlargest(5, '')

25000    Wal-Mart Stores
24500    Wal-Mart Stores
24000    Wal-Mart Stores
23500    Wal-Mart Stores
23000        Exxon Mobil
Name: Công ty, dtype: object

9. Vẽ biểu đồ so sánh Income trung bình của 5 Company có Income trung bình thấp nhất